title: PowerShell Whitelisting Bypass - CL_Invocation 
id: 30f33d3a-89d3-11ec-a8a3-0242ac120002
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module. Bypasses application whitelisting and obfuscates process execution.
author: Tim Peck
status: experimental
date: 2021/09/16
modified: 2022/02/09
references:
    - https://twitter.com/bohops/status/948061991012327424
    - https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/
    - https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/
tags:
    - attack.T1216
    - attack.defense_evasion
logsource:
  product: windows
  category: ps_script
  definition: Script block logging must be enabled
detection:
  #useful_information: Script block logging must be enabled: EVID: 4104
  selection:
    ScriptBlockText|contains:
      - 'CL_Invocation.ps1'
      - 'SyncInvoke'
  condition: selection
falsepositives:
  - Legitimate useage of the CL_Invocation.ps1 script
level: medium