title: Masquerading: Executable Filetype Activity - Fonts Folder
id: 30f33f42-89d3-11ec-a8a3-0242ac120002
description: This rule looks for references to unusual file extensions contained inside the C:\Windows\Fonts directory. Malware may attempt to masquerade activity inside this directory as it contains writable permissions to standard users. 
author: Tim (Bobby_Tablez) Peck
status: experimental
date: 2022/01/03
modified: 2022/02/09
references:
    - https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/troj_coinmine.cye
    - https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
    - attack.t1036
    - attack.t1036.005
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|re:
      - '(?i).*c:\\windows\\fonts\\(\S+|\s+)\.(exe|py|rb|cs|jar|ps1|psm1|vb|vbs|bin|bat|cmd|hta|dll|lnk)'
  condition: selection
falsepositives:
  - Unlikely
level: high
