title: Process Abuse: Regsvr32 (squiblydoo) Remote Code Execution
id: 30f34c9e-89d3-11ec-a8a3-0242ac120002
description: Regsvr32.exe is a command-line program used to register and unregister object linking and embedding controls, including dynamic link libraries (DLLs), on Windows systems. Regsvr32.exe can be used to execute arbitrary binaries.
author: Tim Peck
status: experimental
date: 2021/01/20
modified: 2022/02/10
references:
    - https://attack.mitre.org/techniques/T1218/010/
    - https://airbus-cyber-security.com/fileless-malware-behavioural-analysis-kovter-persistence/
    - https://www.rapid7.com/db/modules/exploit/windows/misc/regsvr32_applocker_bypass_server
    - https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
tags:
    - attack.T1218.010
    - attack.signed_binary_proxy_execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: 'regsvr32.exe'
    CommandLine|re:
      - '(?i).*\/i\:.*\.sct\s+scrobj\.dll'
  condition: selection
falsepositives:
  - unknown
level: medium
