title: Process: Ransomware IoC (wmic.exe)
id: 30f34eb0-89d3-11ec-a8a3-0242ac120002
description: Triggers on a well known IoC where the ransomware will inhibit recovery by deleting the system shadow copies using Windows WMI or wmic.exe
author: Tim Peck (Bobby_Tablez)
status: experimental
date: 2021/05/01
modified: 2022/02/10
references:
    - https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
tags:
    - attack.T1490
    - attack.T1485
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: 'wmic.exe'
    CommandLine|re:
      - '(?i).*shadowcopy\s+del.*'
  condition: selection
falsepositives:
  - Unlikely
level: high
